Tekla.Structures.Drawing.SymbolInfo
The SymbolInfo class holds symbol information: the symbol file and the symbol index in the symbol file.

Tekla.Structures.Drawing.SymbolInfo.Default
The default symbol information: the symbol 0 in the xsteel library.

Tekla.Structures.Drawing.SymbolInfo.SymbolIndex
Gets or sets the the symbol index. Throws an ArgumentOutOfRangeException
if the symbol index is not in the range from 0 to 255.

Tekla.Structures.Drawing.SymbolInfo.SymbolFile
Gets or sets the symbol file. E.g. "xsteel".

Tekla.Structures.Drawing.SymbolInfo.#ctor
Creates a new symbol info instance.

Tekla.Structures.Drawing.SymbolInfo.#ctor(System.String,System.Int32)
Creates a new symbol info instance.
Throws System.ArgumentOutOfRangeException: Thrown if the symbol index is invalid.
SymbolFile: The symbol file to be used.
SymbolIndex: The symbol index to be used.

Tekla.Structures.Drawing.SymbolInfo.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.